<?php

$STATUSES = array(
    1 => 'Новая',
    2 => 'Принята',
    3 => 'Выполняется',
    4 => 'Выполнена',
    5 => 'В ожидании',
    6 => 'Закрыта',
    7 => 'Отложена',
    8 => 'Отменена'
);

$STATUSES_ACTIONS= array(
    1 => 'открыл',
    2 => 'принял',
    3 => 'начал выполнять',
    4 => 'выполнил',
    5 => 'отложил',
    6 => 'закрыл',
    7 => 'отложил',
    8 => 'отменил'
);

$ACCESS_LEVEL = array(
    0 => 'только мне',
    1 => 'только администраторам',
    2 => 'руководителям и администраторам',
    3 => 'всем'
);

$TICKET_FIELDS = array(
    'id'            => 'id',
    'title'         => 'Тема',
    'creator'       => 'Постановщик',
    'changer'       => 'Изменил',
    'contractor'    => 'Ответственный',
    'performers'    => 'Исполнители',
    'area'          => 'Территория',
    'description'   => 'Описание',
    'created'       => 'Создана',
    'changed'       => 'Изменена',
    'deadline'      => 'Срок',
    'status'        => 'Статус',
    'type'          => 'Тип',
    'parent'        => 'Родительская заявка',
    'comments'      => 'Комментарии',
    'category'      => 'Категория',
    'access'        => 'Видимость',
    'tags'          => 'Теги'
);

$CHANGES_FIELDS_NAME = array(
    'title'         => 'тему',
    'contractor'    => 'ответственного',
    'performers'    => 'исполнителей',
    'area'          => 'территорию',
    'description'   => 'описание',
    'deadline'      => 'срок',
    'status'        => 'статус',
    'type'          => 'тип',
    'category'      => 'категорию',
    'access'        => 'видимость'
);

$DEFAULT_TICKET = array(
    'area'          => 2,
    'status'        => 1,
    'type'          => 0,
    'category'      => 0,
    'access'        => 3
);

$MONTHS = array(
    1 => "январь", 2=>"февраль", 3=>"март", 4=>"апрель", 5=>"май", 6=>"июнь",
    7=>"июль", 8=>"август", 9=>"сентябрь", 10=>"октябрь", 11=>"ноябрь", 12=>"декабрь"
);

$RATING_NAME = array(
    5 => "отлично",
    4 => "хорошо",
    3 => "удовлетворительно",
    2 => "плохо",
    1 => "очень плохо",
);